
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.comet_eks.module.eks.data.tls_certificate.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "this" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.comet_eks.module.eks.aws_eks_access_entry.this["cluster_creator"] will be created
  + resource "aws_eks_access_entry" "this" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = (known after apply)
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::690893780650:user/tfuser"
      + tags_all          = {
          + "environment" = "Production"
          + "managed_by"  = "terraform"
          + "owner"       = "Bazit Adebiyi"
          + "project"     = "Comet"
        }
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # module.comet_eks.module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"] will be created
  + resource "aws_eks_access_policy_association" "this" {
      + associated_at = (known after apply)
      + cluster_name  = (known after apply)
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::690893780650:user/tfuser"

      + access_scope {
          + type = "cluster"
        }
    }

  # module.comet_eks.module.eks.aws_eks_cluster.this[0] must be replaced
+/- resource "aws_eks_cluster" "this" {
      ~ arn                           = "arn:aws:eks:us-east-2:690893780650:cluster/comet-eks" -> (known after apply)
      ~ certificate_authority         = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURCVENDQWUyZ0F3SUJBZ0lJQlVUUFQyNXRhaWt3RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TlRBM01UZ3lNakF5TlRKYUZ3MHpOVEEzTVRZeU1qQTNOVEphTUJVeApFekFSQmdOVkJBTVRDbXQxWW1WeWJtVjBaWE13Z2dFaU1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLCkFvSUJBUURKNmNvblRvWncyV1VpZi9xZTBQNUx4aVl2NUJqM0JZTFJrMHQ2V2NYbjA4c1haaWNlUGU5R2s4MUMKU0tUMkJ4eUpObU9UQkpLa1VpRlFkbHhGVVNKL01rSEFUYmRlQlZES2JidTlNcmxrcGlRd21jSjVvWXJLNjRSSwpuSmxqRmpZZGpMN0FZRkJkT2NvaC9NOEY4UGxueE0rTnVwUnBzRGZUaFhVWFdISk9OTUYrclFRcG9wQnBobGgyCi9TejVGTlZhSU5qSGxRemxJL3B5WkttdFIxdE9mSUUxTkhiUnFlbmVscDV1QW1lS0R6cFI3UG1ucjFmSnZTVmYKaEhUOUpmUGtFNDh5THhiMUdrTUZHejJtelJsUjNSRHA3cHVzZ3cxRzkvNmxHRVF3OTA5RVpZa0IrRVkrRTM0UgpIV0FaOTFQUDVJeFhjVUREWDRmeHBpR1JYOVp2QWdNQkFBR2pXVEJYTUE0R0ExVWREd0VCL3dRRUF3SUNwREFQCkJnTlZIUk1CQWY4RUJUQURBUUgvTUIwR0ExVWREZ1FXQkJUSXMvb0c5bjRaODZ0dG55Z3Y1aVNkM3lYUmxEQVYKQmdOVkhSRUVEakFNZ2dwcmRXSmxjbTVsZEdWek1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQUR5YVFsR3M5bwpwMXEyb2JGWWNMY2dPMWxuVFZnM0cwdWpJM21RZ08zQ0tWWU8zNzV1bW5EZXRscHlNcnBjWlJCcG9lajJ0cm9BCjRsOFZkbTFhNVpKWUhyWDJodmQ0a3JoM0FncDRLeWw1d05yN2lLTVpSNUNxZXJNaERpZndsaE1Rd0FFTEVhWlMKb3N4VXVCNW5SeWlsU2p4V2JRS242K0Foa2tvZzZiTVp6VXBDaFNUSzd3cVpQS0VkbTBkeW5sbnZqVDE1RjF5OQpiWkljekZCNXB1dTFvUjlQQ2tCT2JpVkF2N1lmYWlHWExVT1NvTGRlWmI1Mm93elB2WXFXaCt6d1c0RWc0N0dWCkZOSGgyQ3FBRDhIZFhWUFZvUUFHNk1QdnNTMGlIajM1UlVpU0gwUG13QXlSWFRjd2lOQ2YwMjBLWlhiaU9zaEkKZTF6V1RaM0pGRUVtCi0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
            },
        ] -> (known after apply)
      + cluster_id                    = (known after apply)
      ~ created_at                    = "2025-07-18T22:03:40Z" -> (known after apply)
      ~ endpoint                      = "https://CC75DDC734F3725219E784313146E5CF.yl4.us-east-2.eks.amazonaws.com" -> (known after apply)
      ~ id                            = "comet-eks" -> (known after apply)
      ~ identity                      = [
          - {
              - oidc = [
                  - {
                      - issuer = "https://oidc.eks.us-east-2.amazonaws.com/id/CC75DDC734F3725219E784313146E5CF"
                    },
                ]
            },
        ] -> (known after apply)
        name                          = "comet-eks"
      ~ platform_version              = "eks.13" -> (known after apply)
      ~ status                        = "ACTIVE" -> (known after apply)
        tags                          = {
            "terraform-aws-modules" = "eks"
        }
      ~ version                       = "1.32" -> "1.29"
        # (4 unchanged attributes hidden)

      ~ access_config {
          ~ bootstrap_cluster_creator_admin_permissions = true -> false
            # (1 unchanged attribute hidden)
        }

      - encryption_config { # forces replacement
          - resources = [
              - "secrets",
            ] -> null

          - provider {
              - key_arn = "arn:aws:kms:us-east-2:690893780650:key/598a0527-1836-4a74-b93f-676e9fe57600" -> null
            }
        }

      ~ kubernetes_network_config {
          ~ service_ipv4_cidr = "172.20.0.0/16" -> (known after apply)
          + service_ipv6_cidr = (known after apply)
            # (1 unchanged attribute hidden)

          - elastic_load_balancing {
              - enabled = false -> null
            }
        }

      + timeouts {}

      - upgrade_policy {
          - support_type = "EXTENDED" -> null
        }

      ~ vpc_config {
          ~ cluster_security_group_id = "sg-0081d0fbe46199518" -> (known after apply)
          ~ vpc_id                    = "vpc-04f354186a7ba5b19" -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }

  # module.comet_eks.module.eks.aws_iam_openid_connect_provider.oidc_provider[0] will be created
  + resource "aws_iam_openid_connect_provider" "oidc_provider" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "Name" = "comet-eks-eks-irsa"
        }
      + tags_all        = {
          + "Name"        = "comet-eks-eks-irsa"
          + "environment" = "Production"
          + "managed_by"  = "terraform"
          + "owner"       = "Bazit Adebiyi"
          + "project"     = "Comet"
        }
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # module.comet_eks.module.eks.time_sleep.this[0] must be replaced
+/- resource "time_sleep" "this" {
      ~ id              = "2025-07-18T22:13:21Z" -> (known after apply)
      ~ triggers        = { # forces replacement
          ~ "cluster_certificate_authority_data" = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURCVENDQWUyZ0F3SUJBZ0lJQlVUUFQyNXRhaWt3RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TlRBM01UZ3lNakF5TlRKYUZ3MHpOVEEzTVRZeU1qQTNOVEphTUJVeApFekFSQmdOVkJBTVRDbXQxWW1WeWJtVjBaWE13Z2dFaU1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLCkFvSUJBUURKNmNvblRvWncyV1VpZi9xZTBQNUx4aVl2NUJqM0JZTFJrMHQ2V2NYbjA4c1haaWNlUGU5R2s4MUMKU0tUMkJ4eUpObU9UQkpLa1VpRlFkbHhGVVNKL01rSEFUYmRlQlZES2JidTlNcmxrcGlRd21jSjVvWXJLNjRSSwpuSmxqRmpZZGpMN0FZRkJkT2NvaC9NOEY4UGxueE0rTnVwUnBzRGZUaFhVWFdISk9OTUYrclFRcG9wQnBobGgyCi9TejVGTlZhSU5qSGxRemxJL3B5WkttdFIxdE9mSUUxTkhiUnFlbmVscDV1QW1lS0R6cFI3UG1ucjFmSnZTVmYKaEhUOUpmUGtFNDh5THhiMUdrTUZHejJtelJsUjNSRHA3cHVzZ3cxRzkvNmxHRVF3OTA5RVpZa0IrRVkrRTM0UgpIV0FaOTFQUDVJeFhjVUREWDRmeHBpR1JYOVp2QWdNQkFBR2pXVEJYTUE0R0ExVWREd0VCL3dRRUF3SUNwREFQCkJnTlZIUk1CQWY4RUJUQURBUUgvTUIwR0ExVWREZ1FXQkJUSXMvb0c5bjRaODZ0dG55Z3Y1aVNkM3lYUmxEQVYKQmdOVkhSRUVEakFNZ2dwcmRXSmxjbTVsZEdWek1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQUR5YVFsR3M5bwpwMXEyb2JGWWNMY2dPMWxuVFZnM0cwdWpJM21RZ08zQ0tWWU8zNzV1bW5EZXRscHlNcnBjWlJCcG9lajJ0cm9BCjRsOFZkbTFhNVpKWUhyWDJodmQ0a3JoM0FncDRLeWw1d05yN2lLTVpSNUNxZXJNaERpZndsaE1Rd0FFTEVhWlMKb3N4VXVCNW5SeWlsU2p4V2JRS242K0Foa2tvZzZiTVp6VXBDaFNUSzd3cVpQS0VkbTBkeW5sbnZqVDE1RjF5OQpiWkljekZCNXB1dTFvUjlQQ2tCT2JpVkF2N1lmYWlHWExVT1NvTGRlWmI1Mm93elB2WXFXaCt6d1c0RWc0N0dWCkZOSGgyQ3FBRDhIZFhWUFZvUUFHNk1QdnNTMGlIajM1UlVpU0gwUG13QXlSWFRjd2lOQ2YwMjBLWlhiaU9zaEkKZTF6V1RaM0pGRUVtCi0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K" -> (known after apply)
          ~ "cluster_endpoint"                   = "https://CC75DDC734F3725219E784313146E5CF.yl4.us-east-2.eks.amazonaws.com" -> (known after apply)
          ~ "cluster_name"                       = "comet-eks" -> (known after apply)
          ~ "cluster_service_cidr"               = "172.20.0.0/16" -> (known after apply)
          ~ "cluster_version"                    = "1.32" -> "1.29"
        }
        # (1 unchanged attribute hidden)
    }

  # module.comet_eks.module.eks.module.eks_managed_node_group["default"].aws_eks_node_group.this[0] is tainted, so must be replaced
+/- resource "aws_eks_node_group" "this" {
      ~ ami_type               = "AL2023_x86_64_STANDARD" -> (known after apply)
      ~ arn                    = "arn:aws:eks:us-east-2:690893780650:nodegroup/comet-eks/comet-eks-default-20250719005132750200000001/f8cc1015-1919-1939-c3e4-c715128eef27" -> (known after apply)
      ~ cluster_name           = "comet-eks" -> (known after apply)
      ~ disk_size              = 0 -> (known after apply)
      ~ id                     = "comet-eks:comet-eks-default-20250719005132750200000001" -> (known after apply)
      ~ node_group_name        = "comet-eks-default-20250719005132750200000001" -> (known after apply)
      ~ release_version        = "1.32.3-20250715" -> (known after apply)
      ~ resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-comet-eks-default-20250719005132750200000001-f8cc1015-1919-1939-c3e4-c715128eef27"
                    },
                ]
              - remote_access_security_group_id = ""
            },
        ] -> (known after apply)
      ~ status                 = "CREATE_FAILED" -> (known after apply)
        tags                   = {
            "Name" = "comet-eks-default"
        }
      ~ version                = "1.32" -> "1.29"
        # (7 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-05d6857f242763f62"
          ~ name    = "comet-eks-default-lt-20250718221321970200000001" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ update_config {
          - max_unavailable            = 0 -> null
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.comet_eks.module.eks.module.eks_managed_node_group["default"].aws_eks_node_group.this[0] (deposed object 17f2a6c1) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_eks_node_group" "this" {
      - ami_type               = "AL2023_x86_64_STANDARD" -> null
      - arn                    = "arn:aws:eks:us-east-2:690893780650:nodegroup/comet-eks/comet-eks-default-20250719004656353900000001/d6cc1012-fcd8-062b-5dac-62823183be74" -> null
      - capacity_type          = "ON_DEMAND" -> null
      - cluster_name           = "comet-eks" -> null
      - disk_size              = 0 -> null
      - id                     = "comet-eks:comet-eks-default-20250719004656353900000001" -> null
      - instance_types         = [
          - "t3.medium",
        ] -> null
      - labels                 = {
          - "role" = "worker"
        } -> null
      - node_group_name        = "comet-eks-default-20250719004656353900000001" -> null
      - node_group_name_prefix = "comet-eks-default-" -> null
      - node_role_arn          = "arn:aws:iam::690893780650:role/comet-eks-default-eks-node-group-20250718213707620700000001" -> null
      - release_version        = "1.32.3-20250715" -> null
      - resources              = [
          - {
              - autoscaling_groups              = []
              - remote_access_security_group_id = ""
            },
        ] -> null
      - status                 = "CREATE_FAILED" -> null
      - subnet_ids             = [
          - "subnet-062d7aff1f495ff3e",
          - "subnet-06b867712f8045f7b",
          - "subnet-07d74f36159db3f86",
          - "subnet-0963b11e9347b780b",
          - "subnet-0b1405320f2d10b39",
          - "subnet-0f977bae6600f823f",
        ] -> null
      - tags                   = {
          - "Name" = "comet-eks-default"
        } -> null
      - tags_all               = {
          - "Name"        = "comet-eks-default"
          - "environment" = "Production"
          - "managed_by"  = "terraform"
          - "owner"       = "Bazit Adebiyi"
          - "project"     = "Comet"
        } -> null
      - version                = "1.32" -> null

      - launch_template {
          - id      = "lt-05d6857f242763f62" -> null
          - name    = "comet-eks-default-lt-20250718221321970200000001" -> null
          - version = "2" -> null
        }

      - scaling_config {
          - desired_size = 2 -> null
          - max_size     = 3 -> null
          - min_size     = 1 -> null
        }

      - timeouts {}

      - update_config {
          - max_unavailable            = 0 -> null
          - max_unavailable_percentage = 33 -> null
        }
    }

  # module.comet_eks.module.eks.module.eks_managed_node_group["default"].aws_eks_node_group.this[0] (deposed object 5758c61b) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_eks_node_group" "this" {
      - ami_type               = "AL2023_x86_64_STANDARD" -> null
      - arn                    = "arn:aws:eks:us-east-2:690893780650:nodegroup/comet-eks/comet-eks-default-20250719003930999200000002/f2cc100f-9720-c061-d754-bcb59be6af97" -> null
      - capacity_type          = "ON_DEMAND" -> null
      - cluster_name           = "comet-eks" -> null
      - disk_size              = 0 -> null
      - id                     = "comet-eks:comet-eks-default-20250719003930999200000002" -> null
      - instance_types         = [
          - "t3.medium",
        ] -> null
      - labels                 = {
          - "role" = "worker"
        } -> null
      - node_group_name        = "comet-eks-default-20250719003930999200000002" -> null
      - node_group_name_prefix = "comet-eks-default-" -> null
      - node_role_arn          = "arn:aws:iam::690893780650:role/comet-eks-default-eks-node-group-20250718213707620700000001" -> null
      - release_version        = "1.32.3-20250715" -> null
      - resources              = [
          - {
              - autoscaling_groups              = []
              - remote_access_security_group_id = ""
            },
        ] -> null
      - status                 = "CREATE_FAILED" -> null
      - subnet_ids             = [
          - "subnet-062d7aff1f495ff3e",
          - "subnet-06b867712f8045f7b",
          - "subnet-07d74f36159db3f86",
          - "subnet-0963b11e9347b780b",
          - "subnet-0b1405320f2d10b39",
          - "subnet-0f977bae6600f823f",
        ] -> null
      - tags                   = {
          - "Name" = "comet-eks-default"
        } -> null
      - tags_all               = {
          - "Name"        = "comet-eks-default"
          - "environment" = "Production"
          - "managed_by"  = "terraform"
          - "owner"       = "Bazit Adebiyi"
          - "project"     = "Comet"
        } -> null
      - version                = "1.32" -> null

      - launch_template {
          - id      = "lt-05d6857f242763f62" -> null
          - name    = "comet-eks-default-lt-20250718221321970200000001" -> null
          - version = "2" -> null
        }

      - scaling_config {
          - desired_size = 2 -> null
          - max_size     = 3 -> null
          - min_size     = 1 -> null
        }

      - timeouts {}

      - update_config {
          - max_unavailable            = 0 -> null
          - max_unavailable_percentage = 33 -> null
        }
    }

  # module.comet_eks.module.eks.module.eks_managed_node_group["default"].aws_eks_node_group.this[0] (deposed object 969a48c0) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_eks_node_group" "this" {
      - ami_type               = "AL2023_x86_64_STANDARD" -> null
      - arn                    = "arn:aws:eks:us-east-2:690893780650:nodegroup/comet-eks/comet-eks-default-20250718221327601600000003/9ecc0fcc-baf0-c2b3-0ac0-8203e60f5d58" -> null
      - capacity_type          = "ON_DEMAND" -> null
      - cluster_name           = "comet-eks" -> null
      - disk_size              = 0 -> null
      - id                     = "comet-eks:comet-eks-default-20250718221327601600000003" -> null
      - instance_types         = [
          - "t3.medium",
        ] -> null
      - labels                 = {
          - "role" = "worker"
        } -> null
      - node_group_name        = "comet-eks-default-20250718221327601600000003" -> null
      - node_group_name_prefix = "comet-eks-default-" -> null
      - node_role_arn          = "arn:aws:iam::690893780650:role/comet-eks-default-eks-node-group-20250718213707620700000001" -> null
      - release_version        = "1.32.3-20250715" -> null
      - resources              = [
          - {
              - autoscaling_groups              = []
              - remote_access_security_group_id = ""
            },
        ] -> null
      - status                 = "CREATE_FAILED" -> null
      - subnet_ids             = [
          - "subnet-062d7aff1f495ff3e",
          - "subnet-06b867712f8045f7b",
          - "subnet-07d74f36159db3f86",
          - "subnet-0963b11e9347b780b",
          - "subnet-0b1405320f2d10b39",
          - "subnet-0f977bae6600f823f",
        ] -> null
      - tags                   = {
          - "Name" = "comet-eks-default"
        } -> null
      - tags_all               = {
          - "Name"        = "comet-eks-default"
          - "environment" = "Production"
          - "managed_by"  = "terraform"
          - "owner"       = "Bazit Adebiyi"
          - "project"     = "Comet"
        } -> null
      - version                = "1.32" -> null

      - launch_template {
          - id      = "lt-05d6857f242763f62" -> null
          - name    = "comet-eks-default-lt-20250718221321970200000001" -> null
          - version = "1" -> null
        }

      - scaling_config {
          - desired_size = 2 -> null
          - max_size     = 3 -> null
          - min_size     = 1 -> null
        }

      - timeouts {}

      - update_config {
          - max_unavailable            = 0 -> null
          - max_unavailable_percentage = 33 -> null
        }
    }

  # module.comet_eks.module.eks.module.kms.aws_kms_key.this[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_kms_key" "this" {
      - arn                                = "arn:aws:kms:us-east-2:690893780650:key/598a0527-1836-4a74-b93f-676e9fe57600" -> null
      - bypass_policy_lockout_safety_check = false -> null
      - customer_master_key_spec           = "SYMMETRIC_DEFAULT" -> null
      - description                        = "comet-eks cluster encryption key" -> null
      - enable_key_rotation                = true -> null
      - id                                 = "598a0527-1836-4a74-b93f-676e9fe57600" -> null
      - is_enabled                         = true -> null
      - key_id                             = "598a0527-1836-4a74-b93f-676e9fe57600" -> null
      - key_usage                          = "ENCRYPT_DECRYPT" -> null
      - multi_region                       = false -> null
      - policy                             = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "kms:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::690893780650:root"
                        }
                      - Resource  = "*"
                      - Sid       = "Default"
                    },
                  - {
                      - Action    = [
                          - "kms:Update*",
                          - "kms:UntagResource",
                          - "kms:TagResource",
                          - "kms:ScheduleKeyDeletion",
                          - "kms:Revoke*",
                          - "kms:ReplicateKey",
                          - "kms:Put*",
                          - "kms:List*",
                          - "kms:ImportKeyMaterial",
                          - "kms:Get*",
                          - "kms:Enable*",
                          - "kms:Disable*",
                          - "kms:Describe*",
                          - "kms:Delete*",
                          - "kms:Create*",
                          - "kms:CancelKeyDeletion",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::690893780650:user/tfuser"
                        }
                      - Resource  = "*"
                      - Sid       = "KeyAdministration"
                    },
                  - {
                      - Action    = [
                          - "kms:ReEncrypt*",
                          - "kms:GenerateDataKey*",
                          - "kms:Encrypt",
                          - "kms:DescribeKey",
                          - "kms:Decrypt",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::690893780650:role/comet-eks-20250718213707622000000002"
                        }
                      - Resource  = "*"
                      - Sid       = "KeyUsage"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - rotation_period_in_days            = 365 -> null
      - tags                               = {
          - "terraform-aws-modules" = "eks"
        } -> null
      - tags_all                           = {
          - "environment"           = "Production"
          - "managed_by"            = "terraform"
          - "owner"                 = "Bazit Adebiyi"
          - "project"               = "Comet"
          - "terraform-aws-modules" = "eks"
        } -> null
    }

Plan: 6 to add, 0 to change, 7 to destroy.

<!-- Sticky Pull Request Comment -->